Revit 2015 API
EnergyAnalysisOpening Methods
The EnergyAnalysisOpening type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalSurface
 Gets the associative analytical parent surface element.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPolyloop
 Gets the planar polygon describing the opening geometry.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace